Terraform changes from this PR:
-------------------------------

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.covid_stats must be replaced
-/+ resource "google_cloud_run_service" "covid_stats" {
      ~ id                         = "locations/us-east1/namespaces/stanke-covid-stats/services/covid-stats" -> (known after apply)
      ~ name                       = "covid-stats" -> "covid-stats-foo" # forces replacement
      ~ project                    = "stanke-covid-stats" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "covid-stats-m7dv2"
              - latest_ready_revision_name   = "covid-stats-m7dv2"
              - observed_generation          = 1
              - url                          = "https://covid-stats-syyjbfrpfq-ue.a.run.app"
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "serving.knative.dev/creator"       = "62368363434@cloudbuild.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "62368363434@cloudbuild.gserviceaccount.com"
            } -> (known after apply)
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "us-east1"
            } -> (known after apply)
          ~ namespace        = "stanke-covid-stats" -> (known after apply)
          ~ resource_version = "AAXE2RsIuGc" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/62368363434/services/covid-stats" -> (known after apply)
          ~ uid              = "427deaea-e511-4715-8c07-b9f5dbf4b2a8" -> (known after apply)
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                  - "run.googleapis.com/sandbox"       = "gvisor"
                } -> (known after apply)
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {} -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                    # (1 unchanged attribute hidden)

                  ~ ports {
                      ~ container_port = 8080 -> (known after apply)
                      ~ name           = "http1" -> (known after apply)
                      + protocol       = (known after apply)
                    }

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> (known after apply)
                      ~ requests = {} -> (known after apply)
                    }
                }
            }
        }

      ~ traffic {
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ cloud_run_endpoint = "https://covid-stats-syyjbfrpfq-ue.a.run.app" -> (known after apply)
